Revit 2027 API
IFCImportOptions.LinkOrientation Property
 The orientation of the Linked IFC File in the Host Document.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCLinkOrientation LinkOrientation { get; set; }
Public Property LinkOrientation As IFCLinkOrientation
	Get
	Set
public:
property IFCLinkOrientation LinkOrientation {
	IFCLinkOrientation get ();
	void set (IFCLinkOrientation value);
}
member LinkOrientation : IFCLinkOrientation with get, set
Property Value
IFCLinkOrientation
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 Link Orientation only applies during a Link IFC operation.
See Also
Reference
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace